# PANDAS ESSENTIAL FUNCTIONALITY

## Reindexing

In [1]:
import pandas as pd # indirect access to methods using pd.
from pandas import Series, DataFrame # direct access in local namespace
import numpy as np

In [2]:
obj = Series([4.5, 7.2, -5.3, 3.6], index = ['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [3]:
obj = obj.reindex(['a','b','c','d','e'], fill_value = 0)
obj

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [4]:
#forward fill
obj3 = Series(['blue','purple','yellow'], index = [0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [5]:
obj3 = obj3.reindex(range(6), method='ffill')
obj3

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [6]:
# reindex can alter rows, columns, or both
frame = DataFrame(np.arange(9).reshape(3,3), index = ['a','c','d'],
                                             columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [7]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [8]:
frame3 = frame2.reindex(columns=['Texas','California','Ohio'])
frame3

   Texas  California  Ohio
a    1.0         2.0   0.0
b    NaN         NaN   NaN
c    4.0         5.0   3.0
d    7.0         8.0   6.0

In [9]:
frame4 = frame3.drop('b')
frame4

   Texas  California  Ohio
a    1.0         2.0   0.0
c    4.0         5.0   3.0
d    7.0         8.0   6.0

## Arithmetic and Data Alignment

### For Series

In [10]:
s1 = Series([7.3, -2.5, 4.3, 6.0], index=['a','c','d','e'])
s2 = Series([3.3, -1.5, 4.9, 5.1, 7.9], index=['a','c','d','e','f'])
s1 + s2

a    10.6
c    -4.0
d     9.2
e    11.1
f     NaN
dtype: float64

### For DataFrame

In [11]:
df1 = DataFrame(np.arange(9.).reshape(3,3), index = ['Ohio','Texas','Colorado'], columns=list('bcd'))
df2= DataFrame(np.arange(12.).reshape(4,3), index = ['Ohio','Texas','Oregon','Colorado'], columns=list('bde'))
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [12]:
df2

            b     d     e
Ohio      0.0   1.0   2.0
Texas     3.0   4.0   5.0
Oregon    6.0   7.0   8.0
Colorado  9.0  10.0  11.0

In [13]:
df1 + df2

             b   c     d   e
Colorado  15.0 NaN  18.0 NaN
Ohio       0.0 NaN   3.0 NaN
Oregon     NaN NaN   NaN NaN
Texas      6.0 NaN   9.0 NaN

### uFunction application and mapping

In [14]:
frame = DataFrame(np.random.randn(4,3), index = ['Ohio','Texas','Oregon','Colorado'], columns=list('bde'))
frame

                 b         d         e
Ohio      1.666118  1.398342 -0.002727
Texas    -0.526165 -0.616895  0.397182
Oregon    0.865131  0.241170 -0.413799
Colorado -1.236665  1.951638  1.503036

In [15]:
np.abs(frame)

                 b         d         e
Ohio      1.666118  1.398342  0.002727
Texas     0.526165  0.616895  0.397182
Oregon    0.865131  0.241170  0.413799
Colorado  1.236665  1.951638  1.503036

In [16]:
diff = lambda x: x.max() - x.min()
frame.apply(diff)

b    2.902783
d    2.568533
e    1.916835
dtype: float64

In [17]:
frame.apply(diff, axis=1)

Ohio        1.668845
Texas       1.014077
Oregon      1.278931
Colorado    3.188303
dtype: float64

In [18]:
frame.sort_index() # along axis 0, vertical

                 b         d         e
Colorado -1.236665  1.951638  1.503036
Ohio      1.666118  1.398342 -0.002727
Oregon    0.865131  0.241170 -0.413799
Texas    -0.526165 -0.616895  0.397182

In [19]:
frame.sort_index(axis=1, ascending=False) # horizontal axis

                 e         d         b
Ohio     -0.002727  1.398342  1.666118
Texas     0.397182 -0.616895 -0.526165
Oregon   -0.413799  0.241170  0.865131
Colorado  1.503036  1.951638 -1.236665

In [20]:
frame

                 b         d         e
Ohio      1.666118  1.398342 -0.002727
Texas    -0.526165 -0.616895  0.397182
Oregon    0.865131  0.241170 -0.413799
Colorado -1.236665  1.951638  1.503036

In [21]:
frame.rank()

            b    d    e
Ohio      4.0  3.0  2.0
Texas     2.0  1.0  3.0
Oregon    3.0  2.0  1.0
Colorado  1.0  4.0  4.0

### Statistics, Correlation, Covariance

In [22]:
frame.describe()

              b         d         e
count  4.000000  4.000000  4.000000
mean   0.192105  0.743564  0.370923
std    1.314404  1.153462  0.824171
min   -1.236665 -0.616895 -0.413799
25%   -0.703790  0.026654 -0.105495
50%    0.169483  0.819756  0.197227
75%    1.065378  1.536666  0.673645
max    1.666118  1.951638  1.503036

In [23]:
 !pip3 install pandas-datareader

/bin/sh: pip3: command not found